cfd/3Dpincell/initialCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Scales vertices to mm
convertToMeters 0.001;

/*
A hexagonal prism
      
     /9-------8\
    /|   25    |\
 6 / |    .    | \ 7
  |\ |         | /|
  | \|         |/ |
  |  11--------10 |
  |  |         |  |
  |  |         |  |
  |  |         |  |
  |  |3-------2|  |
  | /|   24    |\ |
 0|/ |    .    | \|1
   \ |         | /
    \|         |/
     5---------4

(24 and 25 are the centers of the top and bottom faces)

      /21--20\
  18 /|  .   |\ 19
    |\|  25  |/|
    | 23----22 |
    | |      | |
    | |      | |
    | |      | |
    | |15--14| |
  12|/|  .   |\|13
     \|  24  |/
      17----16

 Interpolation points for defining circular arcs

                    90°
                     |
                -----------
             --/           \--
            /                 \
           /                   \
150° ---- *                     * ---- 30°
         |                       |
         |                       |
210° ---- *                     * ---- 330°
           \                   /
            \                 /
             --\           /--
                -----------
                     |
                    270°

==================================
|      | Sin(θ) |  Cos(θ)        |
==================================
| 30°  |  0.5   |   0.8660254038 |
| 90°  |  1.0   |   0.0          |
| 150° |  0.5   |  -0.8660254038 |
| 210° | -0.5   |  -0.8660254038 |
| 270° | -1.0   |   0.0          |
| 330° | -0.5   |   0.8660254038 |
==================================

*/

vertices
( /*===================
  |   Outer Hexagon   |
  ====================*/
  /*-----------------
  |   Bottom face   |
  ------------------*/
  (-7.425 0 0)            // Vertex 0
  ( 7.425 0 0)            // Vertex 1
  ( 3.7125  6.430239 0)   // Vertex 2
  (-3.7125  6.430239 0)   // Vertex 3
  ( 3.7125 -6.430239 0)   // Vertex 4
  (-3.7125 -6.430239 0)   // Vertex 5

  /*--------------
  |   Top face   |
  ---------------*/
  (-7.425 0 10)           // Vertex 6
  ( 7.425 0 10)           // Vertex 7
  ( 3.7125  6.430239 10)  // Vertex 8 
  (-3.7125  6.430239 10)  // Vertex 9
  ( 3.7125 -6.430239 10)  // Vertex 10
  (-3.7125 -6.430239 10)  // Vertex 11

  /*===================
  |   Inner Hexagon   |
  ====================*/
  /*-----------------
  |   Bottom face   |
  ------------------*/
  (-5.5 0 0)            // Vertex 12
  ( 5.5 0 0)            // Vertex 13
  ( 2.75  4.763140 0)   // Vertex 14
  (-2.75  4.763140 0)   // Vertex 15
  ( 2.75 -4.763140 0)   // Vertex 16
  (-2.75 -4.763140 0)   // Vertex 17

  /*--------------
  |   Top face   |
  ---------------*/
  (-5.5 0 10)           // Vertex 18
  ( 5.5 0 10)           // Vertex 19
  ( 2.75  4.763140 10)  // Vertex 20 
  (-2.75  4.763140 10)  // Vertex 21
  ( 2.75 -4.763140 10)  // Vertex 22
  (-2.75 -4.763140 10)  // Vertex 23

  // Centers
  ( 0 0 0 )             // Vertex 24: Center of bottom face
  ( 0 0 10 )            // Vertex 25: Center of top face

//  /*---------------------------------------
//  |   Interpolation points for top face   |
//  ----------------------------------------*/
//  (  2.75	 4.7631397209 0.0)  // Vertex 26: 30°
//  (  5.5	 0.0          0.0)  // Vertex 27: 90°
//  (  2.75	-4.7631397209 0.0)  // Vertex 28: 150°
//  ( -2.75	-4.7631397209 0.0)  // Vertex 29: 210°
//  ( -5.5	 0.0          0.0)  // Vertex 30: 270°
//  ( -2.75	 4.7631397209 0.0)  // Vertex 31: 330°
//
//
//  /*------------------------------------------
//  |   Interpolation points for bottom face   |
//  -------------------------------------------*/
//  (  2.75	 4.7631397209 10.0)  // Vertex 32: 30°
//  (  5.5	 0.0          10.0)  // Vertex 33: 90°
//  (  2.75	-4.7631397209 10.0)  // Vertex 34: 150°
//  ( -2.75	-4.7631397209 10.0)  // Vertex 35: 210°
//  ( -5.5	 0.0          10.0)  // Vertex 36: 270°
//  ( -2.75	 4.7631397209 10.0)  // Vertex 37: 330°
);

edges
(
  // Arcs on the bottom face
  arc 13 14   (  2.75	 4.7631397209 0.0)  // Vertex 26: 30°
  arc 14 15   (  5.5	 0.0          0.0)  // Vertex 27: 90°
  arc 15 12   (  2.75	-4.7631397209 0.0)  // Vertex 28: 150°
  arc 12 17   ( -2.75	-4.7631397209 0.0)  // Vertex 29: 210°
  arc 17 16   ( -5.5	 0.0          0.0)  // Vertex 30: 270°
  arc 16 13   ( -2.75	 4.7631397209 0.0)  // Vertex 31: 330°

  // Arcs on the top face
  arc 19 20   (  2.75	 4.7631397209 10.0)  // Vertex 32: 30°
  arc 20 21   (  5.5	 0.0          10.0)  // Vertex 33: 90°
  arc 21 18   (  2.75	-4.7631397209 10.0)  // Vertex 34: 150°
  arc 18 23   ( -2.75	-4.7631397209 10.0)  // Vertex 35: 210°
  arc 23 22   ( -5.5	 0.0          10.0)  // Vertex 36: 270°
  arc 22 19   ( -2.75	 4.7631397209 10.0)  // Vertex 37: 330°
);

blocks
(
  /*========================================
  |   Blocks in the Outer Annular Region   |
  =========================================*/
  hex (1 2 14 13 7 8 20 19)    // vertex numbers
  (20 20 20)                   // numbers of cells in each direction
  simpleGrading (1 1 1)        // cell expansion ratios

  hex (2 3 15 14 8 9 21 20)    
  (20 20 20)               
  simpleGrading (1 1 1)    

  hex (3 0 12 15 9 6 18 21)    
  (20 20 20)               
  simpleGrading (1 1 1)    

  hex (0 5 17 12 6 11 23 18)    
  (20 20 20)               
  simpleGrading (1 1 1)    

  hex (5 4 16 17 11 10 22 23)    
  (20 20 20)               
  simpleGrading (1 1 1)    

  hex (4 1 13 16 10 7 19 22)    
  (20 20 20)               
  simpleGrading (1 1 1)    

  /*========================================
  |   Blocks in the Inner Annular Region   |
  =========================================*/

  hex (13 14 15 24 19 20 21 25)
  (20 20 20)
  simpleGrading (1 1 1)

  hex (15 12 17 24 21 18 23 25)
  (20 20 20)
  simpleGrading (1 1 1)

  hex (17 16 13 24 23 22 19 25)
  (20 20 20)
  simpleGrading (1 1 1)
);

boundary
(
  inlet
  {
    type patch;
    faces
    (
      (2 1 13 14)
      (3 2 14 15)
      (0 3 15 12)
      (5 0 12 17)
      (4 5 17 16)
      (1 4 16 13)
    );
  }

  outlet
  {
    type patch;
    faces
    (
      (8 7 19 20)
      (9 8 20 21)
      (6 9 21 18)
      (11 6 18 23)
      (10 11 23 22)
      (7 10 22 19)
    );
  }

  // clad
  // {
  //   type wall;
  //   faces
  //   (
  //     (19 20 14 13)
  //     (20 21 15 14)
  //     (21 18 12 15)
  //     (18 23 17 12)
  //     (23 22 16 17)
  //     (22 19 13 16)
  //   );
  // }

  fuelTubeBottom
  {
    type wall;
    faces
    (
      (15 14 13 24)
      (17 12 15 24)
      (13 16 17 24)
    );
  }

  fuelTubeTop
  {
    type wall;
    faces
    (
      (19 20 21 25)
      (21 18 23 25)
      (23 22 19 25)
    );
  }

  pincellBoundary
  {
    // Need to change this
    type symmetry;
    faces
    (
      (8 7 1 2)
      (9 8 2 3)
      (6 9 3 0)
      (11 6 5 0)
      (10 11 5 4)
      (7 10 4 1)
    );
  }

);