cfd/3Dpincell/initialCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        meanVelocity    10;
        value           uniform (0 0 10);
    }

    outlet
    {
        type            zeroGradient;
    }

    fuelTubeBottom
    {
        type            noSlip;
    }

    fuelTubeTop
    {
        type            noSlip;
    }

    pincellBoundary
    {
        type            symmetry;
    }
}

// ************************************************************************* //